### Тестирование класса DataPreprocessor на датасете Titanic

In [1]:
import pandas as pd

from data_preprocessor import DataPreprocessor

Загрузка датасета

In [2]:
df = pd.read_csv("titanic_train_data.csv")
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Обработка

In [3]:
preprocessor = DataPreprocessor(df)
result = preprocessor.fit_transform()
result.head()

,PassengerId,Survived,Pclass,Name,Age,SibSp,Parch,Ticket,Fare,Sex_female,Sex_male,Embarked_C,Embarked_Q,Embarked_S
0,1,0,3,"Braund, Mr. Owen Harris",22.0,1,0,A/5 21171,7.2500,0,1,0,0,1
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",38.0,1,0,PC 17599,71.2833,1,0,1,0,0
2,3,1,3,"Heikkinen, Miss. Laina",26.0,0,0,STON/O2. 3101282,7.9250,1,0,0,0,1
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",35.0,1,0,113803,53.1000,1,0,0,0,1
4,5,0,3,"Allen, Mr. William Henry",35.0,0,0,373450,8.0500,0,1,0,0,1

Вывод метаданных

In [7]:
metadata = preprocessor.metadata
print(f"Удаленные столбцы:\n{metadata.dropped_columns}\n\n"
      f"Заполнение пропусков ('столбец' : 'чем заполнялись пропуски'):\n{metadata.fill_strategy}\n\n"
      f"Исходные категориальные признаки:\n{metadata.categorical_columns}\n\n"
      f"Новые столбцы (One-Hot Encoding):\n{metadata.encoded_columns}\n\n")

Удаленные столбцы:
['Cabin']

Заполнение пропусков ('столбец' : 'чем заполнялись пропуски'):
{'Age': np.float64(28.0), 'Embarked': 'S'}

Исходные категориальные признаки:
['Sex', 'Embarked']

Новые столбцы (One-Hot Encoding):
['Embarked_Q', 'Embarked_C', 'Sex_female', 'Embarked_S', 'Sex_male']